## Scratch: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 24 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.codedeploy_sns will be created
  + resource "aws_cloudwatch_event_rule" "codedeploy_sns" {
      + arn            = (known after apply)
      + description    = "Alert if CodeDeploy succeeds or fails during deployment"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + state = [
                      + "START",
                      + "SUCCESS",
                      + "FAILURE",
                    ]
                }
              + detail-type = [
                  + "CodeDeploy Deployment State-change Notification",
                ]
              + source      = [
                  + "aws.codedeploy",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "alert-on-codedeploy-status"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.codedeploy_sns will be created
  + resource "aws_cloudwatch_event_target" "codedeploy_sns" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "alert-on-codedeploy-status"
      + target_id      = "CodeDeploy_SNS"

      + input_transformer {
          + input_paths    = {
              + "deploymentID" = "$.detail.deploymentId"
              + "status"       = "$.detail.state"
            }
          + input_template = "\"End User Forms - CloudDeploy has registered a <status> for deployment: <deploymentID>\""
        }
    }

  # aws_cloudwatch_log_metric_filter.application_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "application_error" {
      + id             = (known after apply)
      + log_group_name = "Forms"
      + name           = "ApplicationError"
      + pattern        = "Error"

      + metric_transformation {
          + default_value = "0"
          + name          = "ApplicationError"
          + namespace     = "forms"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.five_hundred_response will be created
  + resource "aws_cloudwatch_log_metric_filter" "five_hundred_response" {
      + id             = (known after apply)
      + log_group_name = "Forms"
      + name           = "500Response"
      + pattern        = "\"HTTP/1.1 5\""

      + metric_transformation {
          + default_value = "0"
          + name          = "500Response"
          + namespace     = "forms"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.application_error_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "application_error_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "End User Forms Warning - An error message was detected in the ECS logs"
      + alarm_name                            = "ApplicationErrorWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApplicationError"
      + namespace                             = "forms"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_forms_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "ddos_detected_forms_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "End User Forms Warning - AWS has detected a DDOS attack on the End User Forms's Load Balancer"
      + alarm_name                            = "DDoSDetectedformsWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:elasticloadbalancing:ca-central-1:722713121070:loadbalancer/app/form-viewer/b38b35c33ee94a8f"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_route53_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "ddos_detected_route53_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "End User Forms Warning - AWS has detected a DDOS attack on the End User Forms's DNS Server"
      + alarm_name                            = "DDoSDetectedRoute53Warn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:route53:::hostedzone/Z02948692OGMOB8MHPBFU"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.five_hundred_response_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "five_hundred_response_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "End User Forms Warning - A 5xx HTML error was detected coming from the Forms."
      + alarm_name                            = "500ResponseWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500Response"
      + namespace                             = "forms"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "forms_cpu_utilization_high_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "End User Forms Warning - High CPU usage has been detected."
      + alarm_name                            = "CpuUtilizationWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Forms"
          + "ServiceName" = "form-viewer"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.forms_dead_letter_queue_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "forms_dead_letter_queue_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "End User Forms Warning - A message has been sent to the Dead Letter Queue."
      + alarm_name                            = "DeadLetterQueueWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 1
      + dimensions                            = {
          + "QueueName" = "deadletter_queue.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesDelayed"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "forms_memory_utilization_high_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "End User Forms Warning - High memory usage has been detected."
      + alarm_name                            = "MemoryUtilizationWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "Forms"
          + "ServiceName" = "form-viewer"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.response_time_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "response_time_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "End User Forms Warning - The latency of response times from the forms are abnormally high."
      + alarm_name                            = "ResponseTimeWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + ok_actions                            = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "m1"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "LoadBalancer" = "app/form-viewer/b38b35c33ee94a8f"
                }
              + metric_name = "TargetResponseTime"
              + namespace   = "AWS/ApplicationELB"
              + period      = 60
              + stat        = "Average"
            }
        }
    }

  # aws_iam_policy.notify_slack_lambda_logging will be created
  + resource "aws_iam_policy" "notify_slack_lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = "notify_slack_lambda_logging"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:722713121070:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.notify_slack_lambda will be created
  + resource "aws_iam_role" "notify_slack_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "NotifySlackLambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.notify_slack_lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "notify_slack_lambda_logging" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "NotifySlackLambda"
    }

  # aws_lambda_function.notify_slack_sns will be created
  + resource "aws_lambda_function" "notify_slack_sns" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/notify_slack.zip"
      + function_name                  = "NotifySlackSNS"
      + handler                        = "notify_slack.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "rjUnDwqVAEH08lRmgFws/Q1x1GWSyGTX/JyPZOqSZQY="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SLACK_WEBHOOK" = "/services/T2G2S06PM/B02JL8E1B5L/N6NcON9qxwTFfk2XLBprz2vm"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.notify_slack_ok will be created
  + resource "aws_lambda_permission" "notify_slack_ok" {
      + action        = "lambda:InvokeFunction"
      + function_name = "NotifySlackSNS"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNSOkAlert"
    }

  # aws_lambda_permission.notify_slack_warning will be created
  + resource "aws_lambda_permission" "notify_slack_warning" {
      + action        = "lambda:InvokeFunction"
      + function_name = "NotifySlackSNS"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNSWarningAlert"
    }

  # aws_sns_topic.alert_ok will be created
  + resource "aws_sns_topic" "alert_ok" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "arn:aws:kms:ca-central-1:722713121070:key/d5d2549a-0261-47ae-9a63-5f77193098b1"
      + name                        = "alert-ok"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.alert_warning will be created
  + resource "aws_sns_topic" "alert_warning" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "arn:aws:kms:ca-central-1:722713121070:key/d5d2549a-0261-47ae-9a63-5f77193098b1"
      + name                        = "alert-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic_policy.cloudwatch_events_ok_sns will be created
  + resource "aws_sns_topic_policy" "cloudwatch_events_ok_sns" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + AWS:SourceOwner = [
                                  + "722713121070",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_policy.cloudwatch_events_warning_sns will be created
  + resource "aws_sns_topic_policy" "cloudwatch_events_warning_sns" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + AWS:SourceOwner = [
                                  + "722713121070",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_subscription.topic_ok will be created
  + resource "aws_sns_topic_subscription" "topic_ok" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.topic_warning will be created
  + resource "aws_sns_topic_subscription" "topic_warning" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.application_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.five_hundred_response_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.response_time_warn"]

17 tests, 8 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
